<!DOCTYPE html>
<html lang="en-US">
    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta name="author" content="Martin Thoma" />
        <meta name="copyright" content="Martin Thoma" />
        <link title = "Martin Thoma"
              type  = "application/opensearchdescription+xml"
              rel   = "search"
              href  = "../opensearch.xml">

        <meta property="og:type" content="article" />
        <meta name="twitter:card" content="summary">

<meta name="keywords" content="money, house, climate change, German posts, " />

<meta property="og:title" content="Wärmepumpen "/>
<meta property="og:url" content="waermepumpen/" />
<meta property="og:description" content="Im Hinblick auf die steigenden Energiekosten und die vergangende Gas-Krise ist die Suche nach effizienten und umweltfreundlichen Heizungsalternativen zu Öl und Gas von großer Bedeutung. Eine Möglichkeit hierbei sind Wärmepumpen. Sie gelten als moderne und nachhaltige Alternative zu herkömmlichen Heizsystemen und sind in den letzten Jahren immer beliebter geworden. In …" />
<meta property="og:site_name" content="Martin Thoma" />
<meta property="og:article:author" content="Martin Thoma" />
<meta property="og:article:published_time" content="2023-03-24T20:00:00+01:00" />
<meta name="twitter:title" content="Wärmepumpen ">
<meta name="twitter:description" content="Im Hinblick auf die steigenden Energiekosten und die vergangende Gas-Krise ist die Suche nach effizienten und umweltfreundlichen Heizungsalternativen zu Öl und Gas von großer Bedeutung. Eine Möglichkeit hierbei sind Wärmepumpen. Sie gelten als moderne und nachhaltige Alternative zu herkömmlichen Heizsystemen und sind in den letzten Jahren immer beliebter geworden. In …">
<meta property="og:image" content="logos/house.png" />
<meta name="twitter:image" content="logos/house.png" >

        <title>Wärmepumpen  · Martin Thoma
</title>
        <!-- Latest compiled and minified CSS -->
        <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">
        <link href="//netdna.bootstrapcdn.com/font-awesome/4.0.1/css/font-awesome.css" rel="stylesheet">
        <link rel="stylesheet" type="text/css" href="../theme/css/pygments.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../theme/tipuesearch/tipuesearch.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../theme/css/elegant.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../static/print.css" media="print">
        <link rel="stylesheet" type="text/css" href="../static/custom.css" media="screen">

        <!-- MathJax -->
<script type="text/x-mathjax-config">
<!--
MathJax.Hub.Config({
  jax: ["input/TeX", "output/HTML-CSS"],
  tex2jax: {
    inlineMath: [['$','$'], ['\\(','\\)']],
    displayMath: [ ['$$', '$$'], ['\\[','\\]']],
    skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code'],
    processEscapes: true
  }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
    }
});
// -->
</script>
<script type="text/javascript" async
  src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML">
</script>

        <link href="https://martin-thoma.com/feeds/all.atom.xml" type="application/atom+xml" rel="alternate" title="Martin Thoma - Full Atom Feed" />
        <link href="https://martin-thoma.com/feeds/index.xml" type="application/rss+xml" rel="alternate" title="Martin Thoma - Full RSS Feed" />
    </head>
    <body>
        <div id="content-sans-footer">
        <div class="navbar navbar-static-top navbar-default">
            <div class="container">
                <div class="container-fluid">
                    <div class="collapse navbar-collapse">
                        <ul class="nav pull-left top-menu navbar-nav">
                            <li><a href=".." style="font-family: 'Monaco', 'Inconsolata', 'Andale Mono', 'Lucida Console', 'Bitstream Vera Sans Mono', 'Courier New', Courier, Monospace;
                        font-size: 20px;" class="navbar-brand" tabindex="-1">Martin Thoma</a>
                            </li>
                        </ul>
                        <ul class="nav pull-right top-menu navbar-nav">
                            <li ><a href="..">Home</a></li>
                            <li ><a href="../categories.html">Categories</a></li>
                            <li ><a href="../tags.html">Tags</a></li>
                            <li ><a href="../archives.html">Archives</a></li>
                            <li><a href="../support-me/">Support me</a></li>
                            <li><form class="navbar-form" action="../search.html" onsubmit="return validateForm(this.elements['q'].value);"> <input type="search" class="search-query form-control" placeholder="Search" name="q" id="tipue_search_input"></form></li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
        <div class="container-fluid">
            <div class="row">
                <div class="col-sm-1 col-md-1"></div>
                <div class="col-sm-10 col-md-10">
<!-- article.html -->
<article>
<div class="row">
    <header class="page-header col-sm-10 col-md-10 col-md-offset-2">
    <h1><a href="../waermepumpen/">Wärmepumpen</a></h1>
    </header>
</div>

<div class="row">
    <div class="col-sm-2 col-md-2 table-of-content">
        <nav>
        <h4>Contents</h4>
        <div id="toc"><ul><li><a class="toc-href" href="#warum-warmepumpen-geil-sind" title="Warum W&auml;rmepumpen geil sind">Warum W&auml;rmepumpen geil sind</a></li><li><a class="toc-href" href="#was-ist-eine-warmepumpe" title="Was ist eine W&auml;rmepumpe?">Was ist eine W&auml;rmepumpe?</a></li><li><a class="toc-href" href="#arten-von-warmepumpen" title="Arten von W&auml;rmepumpen">Arten von W&auml;rmepumpen</a><ul><li><a class="toc-href" href="#erdwarmepumpen" title="Erdw&auml;rmepumpen">Erdw&auml;rmepumpen</a></li></ul></li><li><a class="toc-href" href="#die-auswahl-der-richtigen-warmepumpe_1" title="Die Auswahl der Richtigen W&auml;rmepumpe">Die Auswahl der Richtigen W&auml;rmepumpe</a><ul><li><a class="toc-href" href="#benotigte-heizleistung-berechnen" title="Ben&ouml;tigte Heizleistung berechnen">Ben&ouml;tigte Heizleistung berechnen</a></li></ul></li><li><a class="toc-href" href="#kosten_1" title="Kosten">Kosten</a><ul><li><a class="toc-href" href="#anschaffungs-und-installationskosten" title="Anschaffungs- und Installationskosten">Anschaffungs- und Installationskosten</a></li><li><a class="toc-href" href="#wartungskosten" title="Wartungskosten">Wartungskosten</a></li><li><a class="toc-href" href="#betriebskosten" title="Betriebskosten">Betriebskosten</a></li></ul></li><li><a class="toc-href" href="#der-ubergang-von-ol-auf-strom_1" title="Der &Uuml;bergang von &Ouml;l auf Strom">Der &Uuml;bergang von &Ouml;l auf Strom</a></li><li><a class="toc-href" href="#fazit" title="Fazit">Fazit</a></li></ul></div>
        </nav>
    </div>
    <div class="col-sm-8 col-md-8 article-content" id="contentAfterTitle">

            
            <p>Im Hinblick auf die steigenden Energiekosten und die vergangende
<a href="https://www.tagesschau.de/wirtschaft/gasversorgung-energiekrise-101.html">Gas-Krise</a>
ist die Suche nach effizienten und umweltfreundlichen Heizungsalternativen zu &Ouml;l
und Gas von gro&szlig;er Bedeutung. Eine M&ouml;glichkeit hierbei sind W&auml;rmepumpen. Sie
gelten als moderne und nachhaltige Alternative zu herk&ouml;mmlichen Heizsystemen und
sind in den letzten Jahren immer beliebter geworden. In diesem Artikel wollen
wir Ihnen als Hausbesitzer einen &Uuml;berblick &uuml;ber diese innovative Heiztechnologie
geben und aufzeigen, welche Vorteile und Herausforderungen mit ihrer Nutzung
verbunden sind.</p>
<p>Im Folgenden Vergleiche ich W&auml;rmepumpen vor allem mit &Ouml;l-Heizungen. Insbesondere
bei Fernw&auml;rme / Nahw&auml;rme w&uuml;rden die Vergleiche deutlich anders aussehen.</p>
<h2 id="warum-warmepumpen-geil-sind">Warum W&auml;rmepumpen geil sind</h2>
<p>W&auml;rmepumpen sind f&uuml;r Hausbesitzer eine attraktive Heizoption aus folgenden
Gr&uuml;nden:</p>
<ol>
<li><strong>Energiesparend</strong>: W&auml;rmepumpen sind &auml;u&szlig;erst energieeffizient und k&ouml;nnen zu
   erheblichen Einsparungen bei den Heizkosten f&uuml;hren. Im Vergleich zu
   konventionellen Heizsystemen, die auf der Verbrennung fossiler Brennstoffe
   basieren, k&ouml;nnen W&auml;rmepumpen die Energie aus der Umgebungsluft, dem Erdreich
   oder dem Grundwasser nutzen, um Geb&auml;ude zu beheizen.</li>
<li><strong>Wartungsarm</strong>: Im Gegensatz zu konventionellen Heizsystemen, die regelm&auml;&szlig;ige
   Wartung und Brennstofflieferungen erfordern, ben&ouml;tigen W&auml;rmepumpen keine
   Brennstofflieferungen oder Lagerung und sind somit wartungs&auml;rmer.</li>
<li><strong>Platzsparend</strong>: Im Vergleich zu konventionellen Heizsystemen, die Platz f&uuml;r
   &Ouml;ltanks oder Holzlager ben&ouml;tigen, haben W&auml;rmepumpen einen geringeren
   Platzbedarf.</li>
<li><strong>Emissionsarm</strong>: Wenn man &Ouml;l nutzt, riecht man das in dem Raum. Wenn man Holz
   verbrennt, kann man h&ouml;here Feinstaub-Werte in der Umgebung messen. Das ist
   nicht gut f&uuml;r die eigene Gesundheit.</li>
</ol>
<p>Auch wenn die Anschaffungskosten f&uuml;r eine W&auml;rmepumpe zun&auml;chst h&ouml;her sein k&ouml;nnen
als f&uuml;r konventionelle Heizsysteme, so k&ouml;nnen sich die Investitionen langfristig
durch die Ersparnis bei den Heizkosten amortisieren.</p>
<h2 id="was-ist-eine-warmepumpe">Was ist eine W&auml;rmepumpe?</h2>
<p>Eine W&auml;rmepumpe ist eine Heizungsanlage, die thermische Energie aus der
Umgebungsluft, dem Erdreich oder dem Grundwasser nutzt, um ein Geb&auml;ude zu
beheizen. Die Funktionsweise beruht auf dem Prinzip des K&auml;ltemittelkreislaufs,
der durch Verdampfung und Kondensation von K&auml;ltemittel erfolgt.</p>
<p>Die W&auml;rmepumpe nimmt W&auml;rmeenergie aus der Umgebung auf und erh&ouml;ht die Temperatur
durch Verdichtung des K&auml;ltemittels. Die dadurch erzeugte W&auml;rme wird dann &uuml;ber
einen W&auml;rmetauscher an das Heizsystem des Geb&auml;udes &uuml;bertragen. Dadurch wird die
Raumtemperatur erh&ouml;ht und das Geb&auml;ude beheizt.</p>
<p>Im Sommer kann die W&auml;rmepumpe auch zur K&uuml;hlung genutzt werden, indem sie die
W&auml;rmeenergie aus dem Geb&auml;ude entzieht und nach au&szlig;en abf&uuml;hrt.</p>
<h2 id="arten-von-warmepumpen">Arten von W&auml;rmepumpen</h2>
<p>Es gibt verschiedene Arten von W&auml;rmepumpen, die sich haupts&auml;chlich in der Art
der genutzten Energiequelle und der verwendeten Technologie unterscheiden.</p>
<p><strong>Luft-Luft-W&auml;rmepumpen</strong> nutzen die Energie der Au&szlig;enluft und geben die
erzeugte W&auml;rme direkt an die Raumluft ab. Ein Quick-Connect System macht die
Installation einfacher. Nach EU Verordnung 517/2014 darf nur ein zertifiziertes
Unternehmen Klimager&auml;te in Betrieb nehmen. Eingebaut werden k&ouml;nnen solche
W&auml;rmepumpen von Klimaanlagen-Bauern / K&auml;ltetechnikern, aber auch Heizungsbauer.
Man ben&ouml;tigt einen "K&auml;lteschein".</p>
<p><strong>Luft-Wasser-W&auml;rmepumpen</strong> nutzen die Energie der Umgebungsluft und sind am
h&auml;ufigsten in Wohngeb&auml;uden zu finden.</p>
<p><strong>Erdw&auml;rmepumpen</strong> nutzen die Energie des Erdreichs und sind besonders effizient,
aber auch teurer in der Installation.</p>
<p><strong>Wasser-Wasser-W&auml;rmepumpen</strong> nutzen das Grundwasser und sind ebenfalls effizient,
aber k&ouml;nnen aufgrund von Umweltauflagen schwieriger zu installieren sein.</p>
<p><strong>Hybrid-W&auml;rmepumpen</strong> kombinieren die Vorteile von zwei verschiedenen
Energiequellen, wie z.B. Luft und Erdreich, um die Effizienz zu maximieren.</p>
<p>Jede Art von W&auml;rmepumpe hat ihre eigenen Vor- und Nachteile, und die Wahl h&auml;ngt
oft von den &ouml;rtlichen Gegebenheiten und dem individuellen Energiebedarf ab.</p>
<h3 id="erdwarmepumpen">Erdw&auml;rmepumpen</h3>
<p><strong>Erdw&auml;rmekollektoren</strong> sind eine M&ouml;glichkeit, um die W&auml;rmeenergie aus dem
Erdreich f&uuml;r eine W&auml;rmepumpe zu nutzen. Dabei wird in der Regel ein
geschlossenes Rohrsystem in einer Tiefe von etwa 1,5 bis 2 Metern in der Erde
verlegt. Die Rohre sind mit einer w&auml;rmeleitenden Fl&uuml;ssigkeit gef&uuml;llt und nehmen
die W&auml;rmeenergie aus dem Erdreich auf. Diese wird dann an die W&auml;rmepumpe
weitergegeben, die sie zur Beheizung des Hauses nutzt. Erdw&auml;rmekollektoren
eignen sich besonders f&uuml;r Neubauten, da der Einbau bei bereits bestehenden
Geb&auml;uden aufw&auml;ndiger sein kann. Allerdings ist auch hier eine Heizlastberechnung
notwendig, um die erforderliche Gr&ouml;&szlig;e des Kollektorsystems zu bestimmen. Laut
<a href="https://www.bodenwelten.de/content/energie-aus-dem-boden">bodenwelten.de</a>
ben&ouml;tigt man f&uuml;r eine Heizleistung von <strong>6kW ca. eine Fl&auml;che von 300m&sup2;.</strong></p>
<p><strong>Erdw&auml;rmek&ouml;rbe</strong> sind eine weitere M&ouml;glichkeit zur Nutzung der Erdw&auml;rme als
Energiequelle f&uuml;r W&auml;rmepumpen. Im Gegensatz zu Erdw&auml;rmekollektoren oder
Erdw&auml;rmesonden, die horizontal oder vertikal im Boden verlegt werden, werden bei
der Nutzung von Erdw&auml;rmek&ouml;rben L&ouml;cher in den Boden gebohrt und mit einem
geschlossenen Rohrsystem ausgef&uuml;llt. Die L&auml;nge und Anzahl der K&ouml;rbe h&auml;ngen von
der ben&ouml;tigten Heizleistung ab. Im Allgemeinen sind Erdw&auml;rmek&ouml;rbe in der Regel
tiefer als Erdw&auml;rmekollektoren (bei ca. 2m-4m Tiefe,
<a href="https://www.noventec.de/produkte/erdwaerme/erdwaermekorb/">Quelle</a>), da die
Temperatur unter der <a href="https://de.wikipedia.org/wiki/Frostgrenze">Frostgrenze</a>
des Bodens geringeren Schwankungen unterliegt
(<a href="https://www.noventec.de/produkte/erdwaerme/erdwaermekorb/#1535458531759-c8b3f453-4289">Quelle</a>).
Erdw&auml;rmek&ouml;rbe sind in der Regel f&uuml;r die Bodenklassen 1-4 nach VOB/DIN 18300
geeignet und werden idealerweise in wasserspeichernde Untergr&uuml;nde verbaut.</p>
<p>Eine Alternative zu Erdw&auml;rmekollektoren sind <strong>Erdw&auml;rmesonden</strong>. Bei dieser
Methode werden senkrecht in den Boden gebohrte Rohre verwendet, um die
W&auml;rmeenergie aus dem Erdreich zu gewinnen. Diese Art von W&auml;rmepumpen-System ist
effektiver als Erdw&auml;rmekollektoren, da sie in gr&ouml;&szlig;eren Tiefen platziert werden
k&ouml;nnen und somit eine konstantere Temperaturquelle bieten. Hierbei werden in der
Regel Bohrl&ouml;cher von etwa 50 bis 200 Metern Tiefe in den Boden gebohrt. Ab einer
Tiefe von etwa 15 Metern ist die Bodentemperatur konstant bei etwa 8 bis 12 Grad
Celsius, was f&uuml;r eine effiziente Nutzung mit W&auml;rmepumpen ausreichend ist. Die
Installation von Erdw&auml;rmesonden erfordert jedoch spezielle Bohrger&auml;te und ist in
der Regel teurer als die Installation von Erdw&auml;rmekollektoren.</p>
<p><strong>Tiefengeothermie</strong> ist eine Form der Geothermie, bei der W&auml;rme aus tiefen
Gesteinsschichten gewonnen wird. Im Gegensatz zu den vorherigen Methoden, bei
denen W&auml;rme aus den oberen Bodenschichten oder dem Grundwasser gewonnen wird,
kann bei der Tiefengeothermie auf Temperaturen jenseits der 100 Grad Celsius
zugegriffen werden. Dazu werden Bohrungen bis in eine Tiefe von mehreren
Kilometern vorgenommen, um an das hei&szlig;e Gestein zu gelangen. Die W&auml;rme wird dann
mithilfe von W&auml;rmetauschern und einer W&auml;rmepumpe genutzt. Da diese Methode sehr
aufwendig ist und hohe Investitionskosten verursacht, wird sie vor allem in
industriellen Anwendungen genutzt.</p>
<table>
<tr>
<th>Tiefe</th>
<th>Temperatur</th>
<th>Bohrkosten</th>
</tr>
<tr>
<td>100m</td>
<td>12&deg;C</td>
<td>3.500&euro; bis 7.500&euro;</td>
</tr>
<tr>
<td>200m</td>
<td>15&deg;C</td>
<td></td>
</tr>
<tr>
<td>300m</td>
<td>18 &deg;C</td>
<td></td>
</tr>
<tr>
<td>500m</td>
<td>25-30&deg;C</td>
<td></td>
</tr>
<tr>
<td>1000m</td>
<td>35-45&deg;C</td>
<td></td>
</tr>
<tr>
<td>2000m</td>
<td>60-80 &deg;C</td>
<td></td>
</tr>
<tr>
<td>3000m</td>
<td>130 &deg;C</td>
<td>3.000.000 &euro; (<a href="https://idw-online.de/de/news66770">Quelle</a>)</td>
</tr>
<tr>
<td>5000m</td>
<td>160 &deg;C</td>
<td>8.000.000 bis 13.000.000 &euro; (<a href="https://structurae.net/de/produkte-services/innovatives-bohrverfahren-fuer-die-tiefengeothermie">Quelle</a>)</td>
</tr>
</table>
<p>Diese Temperaturen k&ouml;nnen je nach geologischen Bedingungen und Standort variieren. Es ist wichtig zu beachten, dass die Temperaturen bei Tiefengeothermie-Systemen im Vergleich zu flacheren Systemen h&ouml;her sind, was sie zu einer vielversprechenden Energiequelle f&uuml;r die Strom- und W&auml;rmeerzeugung macht.</p>
<p>Zusammenfassen kann man sagen: Man spricht je nach Tiefe von unterschiedlichen Technologien (<a href="https://www.lfu.bayern.de/geologie/geothermie/index.htm">Quelle</a>):</p>
<ul>
<li>0 - 20m: Erdw&auml;rme-Kollektoren / Zwei-Brunnen-System</li>
<li>20 - 200m: Flache Erdw&auml;rme-Sonde</li>
<li>400m - 2000m: Tiefe Erdw&auml;rme-Sonde</li>
<li>2000m - 3000m: Hydrothermale Dublette</li>
<li>4000m - 5000m: Hot-Dry-Rock</li>
</ul>
<h2 id="die-auswahl-der-richtigen-warmepumpe_1">Die Auswahl der Richtigen W&auml;rmepumpe</h2>
<h3 id="benotigte-heizleistung-berechnen">Ben&ouml;tigte Heizleistung berechnen</h3>
<p>Die Heizlastberechnung nach DIN 12831 ist eine Methode, um die ben&ouml;tigte
Heizleistung eines Geb&auml;udes anhand des Verbrauchs zu berechnen. Hierbei werden
verschiedene Faktoren wie die Gr&ouml;&szlig;e und Form des Geb&auml;udes, die D&auml;mmung, die
Fenster und T&uuml;ren sowie die Art der Nutzung ber&uuml;cksichtigt. Ziel ist es, eine
m&ouml;glichst genaue Absch&auml;tzung der ben&ouml;tigten Heizleistung zu ermitteln, um eine
passende W&auml;rmepumpe ausw&auml;hlen zu k&ouml;nnen. Die Heizlastberechnung kann entweder
manuell oder mit speziellen Softwareprogrammen durchgef&uuml;hrt werden. Es ist
empfehlenswert, die Berechnung von einem Fachmann durchf&uuml;hren zu lassen, um eine
genaue und zuverl&auml;ssige Einsch&auml;tzung zu erhalten.</p>
<p>Die wesentlichen Einflussfaktoren bei der Heizlastberechnung nach DIN 12831 sind
unter anderem:</p>
<ul>
<li>Die Geb&auml;udegeometrie und -ausrichtung</li>
<li>Die Gr&ouml;&szlig;e und Anzahl der Fenster und T&uuml;ren</li>
<li>Die Art und Qualit&auml;t der W&auml;rmed&auml;mmung</li>
<li>Die Art der Nutzung (z.B. Wohngeb&auml;ude, B&uuml;rogeb&auml;ude, Gewerbegeb&auml;ude)</li>
<li>Die Anzahl der Bewohner oder Nutzer</li>
<li>Die Norm-Au&szlig;entemperatur</li>
<li>Die beheizte Wohnfl&auml;che</li>
</ul>
<p>Eine Faustformel zur groben Absch&auml;tzung der ben&ouml;tigten Heizleistung
besagt, dass man etwa 100 Watt pro Quadratmeter Wohnfl&auml;che f&uuml;r ein
durchschnittlich ged&auml;mmtes Einfamilienhaus rechnen kann. Allerdings ist diese
Faustformel nur als grobe Orientierung zu verstehen und ersetzt keinesfalls eine
genaue Heizlastberechnung nach DIN 12831.</p>
<p>Etwas besser geht es mit <a href="https://www.waermepumpe.de/normen-technik/heizlastrechner/">waermepumpe.de</a>. Dort w&uuml;rde ich bei meinem Haus auf 9.3 kWh nach Baualtersklasse
und auf 7.2 kWh nach Jahresverbrauch kommen.</p>
<p><a href="https://www.heizsparer.de/heizung/heiztechnik/heizleistung-berechnen">heizsparer.de</a>
gibt auch eine Formel an:</p>
<ul>
<li>Wohnfl&auml;che: 155m&sup2;</li>
<li><a href="https://www.waermepumpe.de/normen-technik/klimakarte/">Norm-Au&szlig;entemperatur ermitteln</a>: -13.3&deg;C</li>
<li>Wunschtemperatur: 25&deg;C</li>
<li>U-Wert des Hauses: 2.83 W/(m&sup2; * K)</li>
</ul>
<p>Ergibt:</p>
<ul>
<li>Temperatur-Delta: (25&deg;C - (-13.3&deg;C) ) = 38.3&deg;C = 38.3 K</li>
<li><strong>Ben&ouml;tigte Heizleistung</strong>: 2.83 W/(m&sup2; * K) * 155m&sup2; * 38.3 K = <strong>16.8 kW</strong></li>
</ul>
<h2 id="kosten_1">Kosten</h2>
<p>Die Anschaffungs-, Wartungs- und Betriebskosten sind wichtige Faktoren bei der
Wahl der passenden W&auml;rmepumpe. Im Folgenden werden diese Kostenfaktoren im
Vergleich der verschiedenen W&auml;rmepumpentypen betrachtet.</p>
<p>Ich runde im folgenden auf ganze 50&euro; auf. Mich interessiert der SCOP bei einer
Vorlauftemperatur von 55&deg;C.</p>
<table>
<tr>
<th></th>
<th>Anschaffungskosten</th>
<th>Lebensdauer</th>
<th>Installationskosten</th>
<th>Wartungskosten</th>
<th>Betriebskosten (15.000 kWh/Jahr)</th>
<th>Kosten 30 Jahre</th>
<th>Bemerkungen</th>
</tr>
<tr>
<td>&Ouml;lheizung</td>
<td>4090 &euro; (Wolf ComfortLine COB-2)<br/>+4000&euro; &Ouml;ltank<br/>+2000 &euro; Brennwerttechnik / Schornstein</td>
<td>20 Jahre (<a href="https://praxistipps.focus.de/lebensdauer-einer-heizung-informationen-zu-verschleiss-und-haltbarkeit_98439">Quelle</a>)</td>
<td>1500 &euro;</td>
<td>160&euro;/Jahr f&uuml;r die Heizung (<a href="https://www.heizspiegel.de/heizkosten-senken/heizungswartung/">Quelle</a>)<br/>+ 110&euro;/Jahr f&uuml;r den Schornsteinfeger</td>
<td>9.8 kWh/L; 1.15 &euro;/L =&gt; 1800&euro;/Jahr</td>
<td>80k &euro;</td>
<td>&Ouml;ltank verbraucht Platz, es muss ein Zugang von der Stra&szlig;e zum &Ouml;ltank freigehalten werden, das &Ouml;l hat zumindest im Heizraum einen Starken geruch, man ist abh&auml;ngig von schwankenden &Ouml;lpreisen und deren Verf&uuml;gbarkeit</td>
</tr>
<tr>
<td>Luft-Luft-W&auml;rmepumpe</td>
<td>5250&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>):<br/>
            5x LG S09 (2.5 kW, Schlafzimmer/B&uuml;ro/Kinderzimmer/Bad/K&uuml;che) &agrave; 790&euro; oder Samsung AR35 &agrave; 590&euro;  oder Panasonic CS-PZ25-VKE &agrave; 890 &euro; oder Daikin Siesta ATXF25D &agrave; 1100&euro; oder <a href="https://www.klimaprofis.com/klimageraete/split-klimageraete/wandklimageraete/mitsubishi-electric-msz-ap42vgk-wifi-r32-kompakt-wandklimageraete-set-4-5-kw">Mitsubishi MSZ AP42VG</a> &agrave; 1600&euro;<br/>
            + 1x LG S18 (5.0 kW, Wohnzimmer) oder Mitsubishi MSZ-HR50VF R32 &agrave; 1300&euro;</td>
<td>15 Jahre (<a href="https://m-tec.at/blog/10-mythen-zum-thema-waermepumpen/">Quelle</a>)</td>
<td>15.000&euro;  (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>140 &euro;/Jahr (<a href="https://www.heizspiegel.de/heizkosten-senken/heizungswartung/">Quelle</a>)</td>
<td>COP von 4.2, 0.33&euro;/kWh =&gt; 1200 &euro;/Jahr</td>
<td>90k &euro;</td>
<td>Einfache Installation, dezentral, kann im Sommer k&uuml;hlen; ggf. st&ouml;render L&auml;rm (typisch sind 35 dB(A))</td>
</tr>
<tr>
<td>Luft-Wasser-W&auml;rmepumpe</td>
<td>14.000 &euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>15 Jahre (<a href="https://m-tec.at/blog/10-mythen-zum-thema-waermepumpen/">Quelle</a>)</td>
<td>4.000&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>50 - 100&euro;, alle 1-3 Jahre (<a href="https://blog.kelag.at/waermepumpe-wartung">Quelle</a>)</td>
<td>SCOP=4.2 (<a href="https://www.bosch-thermotechnology.com/ocsmedia/optimized/full/o473837v272_Folder_Compress7800iW_EK_1220_web.pdf">5.4 m&ouml;glich</a>), 0.33&euro;/kWh =&gt; 1200 &euro;/Jahr</td>
<td>75k &euro;</td>
<td>Man kann ggf. bestehende Heizungen verwenden, insbesondere wenn Fu&szlig;bodenheizungen vorliegen</td>
</tr>
<tr>
<td>Erdw&auml;rmekollektoren / Erdw&auml;rmek&ouml;rbe</td>
<td>15.000&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>25 Jahre (<a href="https://m-tec.at/blog/10-mythen-zum-thema-waermepumpen/">Quelle</a>)</td>
<td>10.000&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>50 - 100&euro;, alle 1-3 Jahre (<a href="https://blog.kelag.at/waermepumpe-wartung">Quelle</a>)</td>
<td><a href="https://www.nibe.eu/assets/documents/26254/531075-1.pdf">SCOP=4.3</a>, 0.33&euro;/kWh =&gt; 1200&euro;/Jahr</td>
<td>49k &euro;</td>
<td>Gro&szlig;er Fl&auml;chenbedarf; tief wurzelnde B&auml;ume wachsen ggf. schlechter</td>
</tr>
<tr>
<td>Erdw&auml;rmesonden</td>
<td>15.000&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>100 Jahre (<a href="https://www.waermepumpe.de/uploads/tx_bcpageflip/Leitfaden_Erdwaerme_2018_Web.pdf">Quelle</a>)</td>
<td>16.500&euro; (<a href="https://www.energieheld.de/heizung/waermepumpe/kosten">Quelle</a>)</td>
<td>50 - 100&euro;, alle 1-3 Jahre (<a href="https://blog.kelag.at/waermepumpe-wartung">Quelle</a>)</td>
<td><a href="https://www.nibe.eu/assets/documents/26254/531075-1.pdf">SCOP=4.3</a>, 0.33&euro;/kWh =&gt; 1200&euro;/Jahr</td>
<td>69k &euro;</td>
<td>F&uuml;r die Gesamtkosten habe ich 30 Jahre Laufzeit angenommen.</td>
</tr>
<tr>
<td>Grundwasserw&auml;rmepumpe</td>
<td>10.000&euro; (<a href="https://www.heizungsfinder.de/waermepumpe/kosten-preise/wasser-wasser">Quelle</a>)</td>
<td>25 Jahre (<a href="https://www.steininger.st/heizung/waermepumpe/grundwasser-waermepumpe">Quelle</a>)</td>
<td>12.000&euro; (<a href="https://www.heizungsfinder.de/waermepumpe/kosten-preise/wasser-wasser">Quelle</a>, <a href="https://www.energie-fachberater.de/heizung-lueftung/heizung/waermepumpe/grundwasserwaermepumpe-alles-zu-funktion-bedingungen-und-kosten.php">Quelle</a>)</td>
<td>100&euro;/Jahr (<a href="https://www.energie-fachberater.de/heizung-lueftung/heizung/waermepumpe/grundwasserwaermepumpe-alles-zu-funktion-bedingungen-und-kosten.php">Quelle</a>)</td>
<td>SCOP=4.15 (<a href="https://www.mtec-systems.com/wp-content/uploads/sites/19/wplk-2021-finale_DoppelseiteWEB.pdf">Quelle</a>), 0.33&euro;/kWh =&gt; 1200&euro;</td>
<td>66k &euro;</td>
<td></td>
</tr>
</table>
<p>Der Vergleich w&uuml;rde deutlich besser ausfallen, wenn man anstelle der 0.33&euro;/kWh
an Strom des Energieversorgers den eigenen Strom der Solarzelle nehemen w&uuml;rde.
Oder wenn man mit einer niedrigeren Vorlauftemperatur auskommen w&uuml;rde.</p>
<p><a href="https://youtu.be/BvI7A3NmY08?t=874">Laut Andreas Schmitz</a> kann man die
Installation der Luft-Luft-W&auml;rmepumpe auch selbst machen. Man braucht eine
Mauernutfr&auml;se (ca. 100&euro;) und eine 50mm-Diamant-Bohrkrone (50&euro;) f&uuml;r die
Kernbohrung. Dann muss der Fachmann es vor der Inbetriebnahme nur noch abnehmen.</p>
<h3 id="anschaffungs-und-installationskosten">Anschaffungs- und Installationskosten</h3>
<p>Die Anschaffungskosten f&uuml;r W&auml;rmepumpen variieren je nach Art und Gr&ouml;&szlig;e der
Anlage. Grunds&auml;tzlich sind Luft-Luft-W&auml;rmepumpen am g&uuml;nstigsten, gefolgt von
Luft-Wasser-W&auml;rmepumpen und Sole-Wasser-W&auml;rmepumpen. Erdw&auml;rmesonden und
Tiefengeothermie-Systeme sind in der Regel am teuersten, da sie aufwendiger zu
installieren sind. Die Kosten f&uuml;r eine W&auml;rmepumpe k&ouml;nnen auch von der Leistung,
Effizienz und der Marke abh&auml;ngen.</p>
<p>In Deutschland gibt es verschiedene <strong>F&ouml;rderprogramme</strong>, die den Einsatz von
W&auml;rmepumpen in Geb&auml;uden unterst&uuml;tzen. So bietet beispielsweise das Bundesamt f&uuml;r
Wirtschaft und Ausfuhrkontrolle (BAFA) finanzielle Zusch&uuml;sse f&uuml;r den Einbau von
W&auml;rmepumpen an, insbesondere im Rahmen des Programms zur F&ouml;rderung von
erneuerbaren Energien im W&auml;rmemarkt (MAP). Auch die Kreditanstalt f&uuml;r
Wiederaufbau (KfW) bietet verschiedene F&ouml;rderm&ouml;glichkeiten an, die den Einsatz
von W&auml;rmepumpen f&ouml;rdern, insbesondere im Bereich der energetischen
Geb&auml;udesanierung. Die genauen F&ouml;rderbedingungen und -h&ouml;hen sind jedoch von
verschiedenen Faktoren abh&auml;ngig, wie zum Beispiel der Art der W&auml;rmepumpe, der
Gr&ouml;&szlig;e des zu beheizenden Geb&auml;udes und der geplanten Ma&szlig;nahme. Interessierte
sollten sich daher im Vorfeld genau &uuml;ber die verschiedenen F&ouml;rderm&ouml;glichkeiten
informieren.</p>
<p>Energetische Sanierungen kann man von der Einkommenssteuer absetzen -
auch f&uuml;rs Eigenheim. Das sind 20% und bis zu 40.000 &euro;. Leider kann man nur
entweder ein F&ouml;rderprogram oder den Steuervorteil nutzen (<a href="https://www.finanztip.de/sanierungskosten-absetzen/">Quelle</a>).</p>
<h3 id="wartungskosten">Wartungskosten</h3>
<p>Die Wartungskosten f&uuml;r W&auml;rmepumpen sind sehr unterschiedlich und h&auml;ngen von
verschiedenen Faktoren ab, wie der Art der W&auml;rmepumpe, der Gr&ouml;&szlig;e, dem Alter und
der Nutzungsdauer. Grunds&auml;tzlich haben Luft-Luft-W&auml;rmepumpen die niedrigsten
Wartungskosten, da sie weniger komplexe Teile als andere W&auml;rmepumpen haben.
Luft-Wasser- und Sole-Wasser-W&auml;rmepumpen ben&ouml;tigen mehr Wartung, da sie Systeme
wie Luft- oder Wasserfilter haben, die regelm&auml;&szlig;ig ausgetauscht werden m&uuml;ssen.
Erdw&auml;rmekollektoren, Erdw&auml;rmesonden und Erdw&auml;rmek&ouml;rbe erfordern weniger Wartung,
da sie im Boden installiert sind und keine beweglichen Teile haben.
Tiefengeothermie-Systeme sind am komplexesten und erfordern die meisten
Wartungskosten, da sie tiefe Bohrungen und komplexe Ausr&uuml;stungen erfordern.
Insgesamt k&ouml;nnen die Wartungskosten f&uuml;r eine W&auml;rmepumpe je nach Typ und Gr&ouml;&szlig;e
zwischen 100 und 500 Euro pro Jahr betragen. Es ist wichtig, regelm&auml;&szlig;ig
Wartungsarbeiten durchzuf&uuml;hren, um eine optimale Leistung und eine l&auml;ngere
Lebensdauer der W&auml;rmepumpe zu gew&auml;hrleisten.</p>
<p>Bei der Wartung muss das K&auml;ltemittel aufgef&uuml;llt/ausgetauscht werden, die
Dichtigkeit gepr&uuml;ft werden, die Anlage gereinigt und Desinfiziert werden, und
ggf. Filter ausgetauscht werden.</p>
<p>Bei &Ouml;l- und Gasheizungen muss der Schornsteinfeger regelm&auml;&szlig;ig kommen. Das f&auml;llt
komplett weg, wenn man ausschlie&szlig;lich W&auml;rmepumpen nutzt.</p>
<h3 id="betriebskosten">Betriebskosten</h3>
<p>Die Betriebskosten einer W&auml;rmepumpe h&auml;ngen von drei Faktoren ab:</p>
<ul>
<li>Die ben&ouml;tigte W&auml;rmeleistung</li>
<li>Die Effizienz der W&auml;rmepumpe</li>
<li>Die Kosten f&uuml;r Strom</li>
</ul>
<p>Die Effizienz einer W&auml;rmepumpe wird durch den COP (Coefficient of Performance)
angegeben, welcher das Verh&auml;ltnis von abgegebener W&auml;rme zu aufgenommener Energie
angibt. Ein h&ouml;herer COP bedeutet eine h&ouml;here Effizienz der W&auml;rmepumpe, da mehr
W&auml;rme aus der selben Menge an Energie erzeugt wird. Die Effizienz einer
W&auml;rmepumpe wird jedoch von verschiedenen Faktoren beeinflusst, wie
beispielsweise der Au&szlig;entemperatur, der Gr&ouml;&szlig;e des zu beheizenden Raums, der Wahl
der W&auml;rmequelle und dem Systemdesign. Es ist daher wichtig, die Effizienz einer
W&auml;rmepumpe sorgf&auml;ltig zu bewerten, um sicherzustellen, dass sie die
Energieeffizienz-Anforderungen des Hauses erf&uuml;llt.</p>
<p>Der SCOP (Seasonal Coefficient of Performance) liefert hier realistischere
Werte. Genau wie der COP sagt er wie viel Heizleistung man f&uuml;r den eingesetzten
Strom bekommt. Ein SCOP=4 bedeutet also, dass man im Mittel f&uuml;r 1kWh Strom ganze
4kWh W&auml;rme bekommt.</p>
<p>Luft-Luft W&auml;rmepumpen haben einen SCOP von 4 bis 5.5. Die <a href="https://www.daikin.at/content/dam/DACE-AT/document-library/einzelblatter/ac/split/Daikin_Split_Perfera_FTXM-R.pdf">Daikin Perfera
25R</a>
hat einen SCOP von 5.2</p>
<p>Die Jahresarbeitszahl bezieht sich dann auf ein konkretes Haus. Das ist der wohl
interessanteste Wert, allerdings kann man diesen naturgem&auml;&szlig; nicht in Datenbl&auml;ttern
von Klimaanlagen nachlesen.</p>
<h2 id="der-ubergang-von-ol-auf-strom_1">Der &Uuml;bergang von &Ouml;l auf Strom</h2>
<p>Andreas Schmitz hat in seinem Video <a href="https://www.youtube.com/watch?v=BvI7A3NmY08">DIY Heizung: G&uuml;nstige Alternative zur
W&auml;rmepumpe f&uuml;r den Altbau</a> ein
paar interessante Sachen gezeigt:</p>
<ul>
<li><strong>Parallelbetrieb</strong>: Er nutzt eine &Ouml;l-Heizung mit Luft-Luft-W&auml;rmepumpen im
  Parallelbetrieb. Dadurch kann er die &Ouml;l-Heizung im ganzen Jahr im Sommer-Modus
  laufen lassen.</li>
<li><strong>Kachelofen</strong>: Wenn es richtig kalt wird nutzt er einen Kachelofen. Das
  bedeutet, er kann die wenigen Tage im Jahr die unter -10&deg;C liegen und damit
  die Effizienz der W&auml;rmepumpe kaputt machen &uuml;berbr&uuml;cken.</li>
<li><strong>Brauchwasserw&auml;rmepumpe</strong>: Im Keller ist es ganzj&auml;hrig deutlich &uuml;ber 0&deg;C,
  aber es k&ouml;nnte auch ohne Probleme k&auml;lter sein. Man k&ouml;nnte z.B. einen K&uuml;hlraum
  machen. Die Stiebel Eltron Warmwasser-W&auml;rmepumpe WWK 220 kostet z.B. 2600&euro;.
  Sollte die &Ouml;lheizung kaputt gehen kann man sie durch eine
  Brauchwasserw&auml;rmepumpe ersetzen. Damit kann man den &Ouml;ltank komplett leeren
  bzw. die Lebensdauer der &Ouml;lheizung komplett ausreizen. Durch die Luft-Luft
  W&auml;rmepumpen wird man auf keinen Fall im kalten sitzen, aber ggf. eine Weile
  kalt duschen.</li>
</ul>
<h2 id="fazit">Fazit</h2>
<p>W&auml;rmepumpen sind ziemlich cool - sie verursachen keinen Feinstaub, verschmutzen
nicht das Wasser, stinken nicht, und brauchen wenig Platz. &Uuml;ber den
Ger&auml;uschpegel muss man sich bei der Platzierung von Split-Klimaanlagen Gedanken
machen. Ach ja, sie k&ouml;nnen im Sommer k&uuml;hlen!</p>
<p>Die hohen Anschaffungskosten und die notwendige niedrige Vorlauftemperatur f&uuml;r
wirklich gute SCOP-Werte machen die Sache wirtschaftlich f&uuml;r Altbauten leider
nicht so eindeutig. Dabei ist allerdings noch nicht die F&ouml;rderung ber&uuml;cksichtig.
Mit F&ouml;rderung ist es klar: W&auml;rmepumpen lohnen sich auch im Altbau. Wenn man
zus&auml;tzlich noch eine Fu&szlig;bodenheizung und/oder Solarzellen hat, ist es eine
runde Sache.</p>
            
        </div>
        <section>
        <div class="col-sm-2 col-md-2" style="float:right;font-size:0.9em;">
            <h4>Published</h4>
            <time pubdate="pubdate" datetime="2023-03-24T20:00:00+01:00">Mär 24, 2023</time>
            <br/>
            by <a rel="author" class="vcard author post-author" itemprop="author" href="../author/martin-thoma/"><span class="fn" itemscope="" itemtype="https://schema.org/Person"><span itemprop="name">Martin Thoma</span></span></a>
            <h4>Category</h4>
            <a class="category-link" href="../categories.html#german-posts-ref">German posts</a>
            <h4>Tags</h4>
            <ul class="list-of-tags tags-in-article">
                <li><a href="../tags.html#climate-change-ref">climate change
                    <span>5</span>
</a></li>
                <li><a href="../tags.html#house-ref">house
                    <span>27</span>
</a></li>
                <li><a href="../tags.html#money-ref">money
                    <span>16</span>
</a></li>
            </ul>
<h4>Contact</h4>
    <a href="https://twitter.com/_martinthoma" title="My Twitter Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-twitter sidebar-social-links"></i></a>
    <a href="mailto:info@martin-thoma.de" title="My Email Address" class="sidebar-social-links" target="_blank">
    <i class="fa fa-envelope sidebar-social-links"></i></a>
    <a href="https://github.com/MartinThoma" title="My Github Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-github sidebar-social-links"></i></a>
    <a href="http://stackoverflow.com/users/562769/martin-thoma" title="My Stackoverflow Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-stackoverflow sidebar-social-links"></i></a>
        </div>
        </section>
</div>
</article>
                </div>
                <div class="col-sm-1 col-md-1"></div>
            </div>
        </div>
        <div id="push"></div>
    </div>
<footer class="no-print">
<div id="footer">
    <ul class="footer-content">
        <li class="elegant-subtitle"><span class="site-name">Martin Thoma</span> - A blog about Code, the Web and Cyberculture</li>
        <li><a href="https://martin-thoma.com/email-subscription">E-mail subscription</a></li>
        <li><a href="https://martin-thoma.com/feeds/index.xml">RSS-Feed</a></li>
        <li><a href="http://www.martin-thoma.de/privacy.htm">Privacy/Datenschutzerkl&auml;rung</a></li>
        <li><a href="http://www.martin-thoma.de/impressum.htm">Impressum</a></li>
        <li class="elegant-power">Powered by
            <a href="https://blog.getpelican.com/" title="Pelican Home Page" tabindex="-1">Pelican</a>.
            Theme: <a href="https://elegant.oncrashreboot.com" title="Theme Elegant Home Page" tabindex="-1">Elegant</a>
            by <a href="https://www.oncrashreboot.com/" title="Talha Mansoor Home Page" tabindex="-1">Talha Mansoor</a></li>
    </ul>
</div>
</footer>        <script src="//code.jquery.com/jquery.min.js"></script>
        <!-- Latest compiled and minified JavaScript -->
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa" crossorigin="anonymous"></script>
        <script>
            function validateForm(query)
            {
                return (query.length > 0);
            }
        </script>
        <script>
(function(){
    'use strict';

    /*
    Create intra-page links
    Requires that your headings already have an `id` attribute set
    For every heading in your page, this adds a little anchor link `#` that you can click to get a permalink to the heading.
    Ignores `h1`, because you should only have one per page.
    The text content of the tag is used to generate the link, so it will fail "gracefully-ish" if you have duplicate heading text.

    Credit: https://gist.github.com/SimplGy/a229d25cdb19d7f21231
     */

    var headingNodes = [], results, link,
        tags = ['h2', 'h3', 'h4', 'h5', 'h6'];

    tags.forEach(function(tag){
        var contentTag = document.getElementById('contentAfterTitle');
      results = contentTag.getElementsByTagName(tag);
      Array.prototype.push.apply(headingNodes, results);
    });

    headingNodes.forEach(function(node){
      link = document.createElement('a');
      link.className = 'deepLink';
      link.textContent = ' ¶';
      link.href = '#' + node.getAttribute('id');
      node.appendChild(link);
    });

  })();
</script>
    </body>
    <!-- Theme: Elegant built for Pelican
    License : https://elegant.oncrashreboot.com -->
</html>