<!DOCTYPE html>
<html lang="en-US">
    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta name="author" content="Martin Thoma" />
        <meta name="copyright" content="Martin Thoma" />
        <link title = "Martin Thoma"
              type  = "application/opensearchdescription+xml"
              rel   = "search"
              href  = "../opensearch.xml">

        <meta property="og:type" content="article" />
        <meta name="twitter:card" content="summary">

<meta name="keywords" content="KIT, German posts, " />

<meta property="og:title" content="Bürokratie am KIT "/>
<meta property="og:url" content="burokratie-am-kit/" />
<meta property="og:description" content="Das KIT sieht sich gerne als Elite-Universität.[1] Es werden Rankings in Vorlesungen zitiert und erst vor kurzem wurde von einigen Professoren in der Vorlesung der Verlust des Status der Elite-Universität betrauert.[1] Ich weiß nicht, was die Kriterien für eine Elite-Uni nach der Exzellenzinitiative sind, aber ich kann mir …" />
<meta property="og:site_name" content="Martin Thoma" />
<meta property="og:article:author" content="Martin Thoma" />
<meta property="og:article:published_time" content="2012-10-17T18:06:31+02:00" />
<meta name="twitter:title" content="Bürokratie am KIT ">
<meta name="twitter:description" content="Das KIT sieht sich gerne als Elite-Universität.[1] Es werden Rankings in Vorlesungen zitiert und erst vor kurzem wurde von einigen Professoren in der Vorlesung der Verlust des Status der Elite-Universität betrauert.[1] Ich weiß nicht, was die Kriterien für eine Elite-Uni nach der Exzellenzinitiative sind, aber ich kann mir …">
<meta property="og:image" content="2011/10/KIT-Logo.png" />
<meta name="twitter:image" content="2011/10/KIT-Logo.png" >

        <title>Bürokratie am KIT  · Martin Thoma
</title>
        <!-- Latest compiled and minified CSS -->
        <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">
        <link href="//netdna.bootstrapcdn.com/font-awesome/4.0.1/css/font-awesome.css" rel="stylesheet">
        <link rel="stylesheet" type="text/css" href="../theme/css/pygments.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../theme/tipuesearch/tipuesearch.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../theme/css/elegant.css" media="screen">
        <link rel="stylesheet" type="text/css" href="../static/print.css" media="print">
        <link rel="stylesheet" type="text/css" href="../static/custom.css" media="screen">

        <!-- MathJax -->
<script type="text/x-mathjax-config">
<!--
MathJax.Hub.Config({
  jax: ["input/TeX", "output/HTML-CSS"],
  tex2jax: {
    inlineMath: [['$','$'], ['\\(','\\)']],
    displayMath: [ ['$$', '$$'], ['\\[','\\]']],
    skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code'],
    processEscapes: true
  }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
    }
});
// -->
</script>
<script type="text/javascript" async
  src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML">
</script>

        <link href="https://martin-thoma.com/feeds/all.atom.xml" type="application/atom+xml" rel="alternate" title="Martin Thoma - Full Atom Feed" />
        <link href="https://martin-thoma.com/feeds/index.xml" type="application/rss+xml" rel="alternate" title="Martin Thoma - Full RSS Feed" />
    </head>
    <body>
        <div id="content-sans-footer">
        <div class="navbar navbar-static-top navbar-default">
            <div class="container">
                <div class="container-fluid">
                    <div class="collapse navbar-collapse">
                        <ul class="nav pull-left top-menu navbar-nav">
                            <li><a href=".." style="font-family: 'Monaco', 'Inconsolata', 'Andale Mono', 'Lucida Console', 'Bitstream Vera Sans Mono', 'Courier New', Courier, Monospace;
                        font-size: 20px;" class="navbar-brand" tabindex="-1">Martin Thoma</a>
                            </li>
                        </ul>
                        <ul class="nav pull-right top-menu navbar-nav">
                            <li ><a href="..">Home</a></li>
                            <li ><a href="../categories.html">Categories</a></li>
                            <li ><a href="../tags.html">Tags</a></li>
                            <li ><a href="../archives.html">Archives</a></li>
                            <li><a href="../support-me/">Support me</a></li>
                            <li><form class="navbar-form" action="../search.html" onsubmit="return validateForm(this.elements['q'].value);"> <input type="search" class="search-query form-control" placeholder="Search" name="q" id="tipue_search_input"></form></li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
        <div class="container-fluid">
            <div class="row">
                <div class="col-sm-1 col-md-1"></div>
                <div class="col-sm-10 col-md-10">
<!-- article.html -->
<article>
<div class="row">
    <header class="page-header col-sm-10 col-md-10 col-md-offset-2">
    <h1><a href="../burokratie-am-kit/">B&uuml;rokratie am KIT</a></h1>
    </header>
</div>

<div class="row">
    <div class="col-sm-2 col-md-2 table-of-content">
        <nav>
        <h4>Contents</h4>
        <div id="toc"><ul><li><a class="toc-href" href="#" title="B&uuml;rokratie am KIT">B&uuml;rokratie am KIT</a><ul><li><a class="toc-href" href="#studienburo" title="Studienb&uuml;ro">Studienb&uuml;ro</a><ul><li><a class="toc-href" href="#schalter-und-schlangen" title="Schalter und Schlangen">Schalter und Schlangen</a></li><li><a class="toc-href" href="#freundlichkeit-und-kompetenz" title="Freundlichkeit und Kompetenz">Freundlichkeit und Kompetenz</a></li></ul></li><li><a class="toc-href" href="#qispos_1" title="QISPOS">QISPOS</a></li><li><a class="toc-href" href="#haufige-probleme-faq" title="H&auml;ufige Probleme - FAQ">H&auml;ufige Probleme - FAQ</a></li></ul></li></ul></div>
        </nav>
    </div>
    <div class="col-sm-8 col-md-8 article-content" id="contentAfterTitle">

            
            <p>Das KIT sieht sich gerne als Elite-Universit&auml;t.<sup>[<a href="http://www.kit.edu/besuchen/pi_2012_11933.php">1</a>]</sup> Es werden Rankings in Vorlesungen zitiert und erst vor kurzem wurde von einigen Professoren in der Vorlesung der Verlust des Status der Elite-Universit&auml;t betrauert.<sup>[<a href="http://bildungsklick.de/a/84162/hippler-elite-verlust-herber-rueckschlag-fuer-kit/">1</a>]</sup> Ich wei&szlig; nicht, was die Kriterien f&uuml;r eine Elite-Uni nach der Exzellenzinitiative sind, aber ich kann mir einige notwendige Voraussetzungen vorstellen, die f&uuml;r mich eine Elite-Uni ausmachen:</p>
<ul>
<li>Lehre
  <ul>
<li>Vorlesungen, die anspruchsvollen Stoff gut strukturiert und aufbereitet vermitteln</li>
<li>&Uuml;bungen, die den Stoff vertiefen und eventuell motivieren</li>
<li>Tutorien, die offene Fragen beantworten und von kompetenten Tutoren gehalten werden</li>
</ul>
</li>
<li>Forschung: Hier kann ich mir nicht anma&szlig;en, gute Kriterien aufstellen zu k&ouml;nnen, da ich selbst noch nicht daran beteiligt bin.</li>
<li>Wirtschaft: vgl. Forschung</li>
</ul>
<p>Damit die Personen, die an Lehre, Forschung und in der Wirtschaft beteiligt sind gut arbeiten k&ouml;nnen, muss die Organisation reibungsfrei verlaufen. Mir ist klar, dass bei 22.552 Studierenden (Stand: M&auml;rz 2012) nicht immer alles reibungsfrei ablaufen kann. Auch der Bologna-Prozess scheint wohl immer noch Probleme nach sich zu ziehen.
Aber f&uuml;r ein paar Probleme, die ich vor kurzem selbst erleben musste, habe ich kein Verst&auml;ndnis. Diese Probleme sind - so scheint es mir - b&uuml;rokratischer und organisatorischer Natur:</p>
<h2 id="studienburo">Studienb&uuml;ro</h2>
<p>Das <a href="http://www.kit.edu/studieren/1960.php">Studienb&uuml;ro</a> hat folgende &Ouml;ffnungszeiten:</p>
<ul>
<li>Mo-Mi: 10:00 - 12:00 Uhr</li>
<li>Do: 13:30 - 15:30 Uhr</li>
</ul>
<p>Es hat also in der Woche nur 8 Stunden ge&ouml;ffnet. Ich war heute (Mittwoch) um 9:40 Uhr Studienb&uuml;ro und es war bereits eine Schlange von ca. 20 Leuten vor der T&uuml;r. Als p&uuml;nktlich um 10:00 Uhr der Eingang ge&ouml;ffnet wurde, reichte die Schlange bereits bis zum gegen&uuml;berliegenden Geb&auml;ude. Man muss nun beobachten, wie sich das im laufe des Semesters verh&auml;lt, aber es ist schon ein deutliches Indiz daf&uuml;r, dass hier entweder M&auml;ngel in der Organisation und Struktur des Studiums bzw. der damit verbundenen Software (z.B. QISPOS) vorliegen, oder zu wenig Personal vorhanden ist.</p>
<h3 id="schalter-und-schlangen">Schalter und Schlangen</h3>
<p>Momentan sind Zettelrollen in verschiedenen Farben aufgestellt. Die Farben sind je nach Studiengang unterschiedlich. Auf jedem Zettel steht eine Nummer und diese wird aufgerufen. Dazu steht eine Frau an der T&uuml;r, ruft die Nummer und h&auml;lt die T&uuml;r auf.</p>
<p>Ich wei&szlig; nicht ob diese Frau noch irgendetwas anderes macht, aber es scheint nicht der Fall zu sein. Wenn sie in dieser Zeit einen weiteren Schalter betreuen w&uuml;rde und das Aufrufen wie bei der Bahn oder im Finanzamt &uuml;ber eine elektronische Anzeige geschehen w&uuml;rde, h&auml;tte man vermutlich schon eine Effizienzsteigerung. Die aktuelle Nummer k&ouml;nnte man dann auch &uuml;ber einen Webdienst verf&uuml;gbar machen, sodass man in der Zwischenzeit auch etwas sinnvolleres machen kann.</p>
<p>Nach ein paar Minuten wurde gefragt: "Gibt es noch irgendjemanden der einen blauen Zettel hat?". Es gab niemanden. Was passiert dann? Ist eine Arbeitskraft dann unt&auml;tig, obwohl noch 50 Leute auf Hilfe / Antworten warten?</p>
<h3 id="freundlichkeit-und-kompetenz">Freundlichkeit und Kompetenz</h3>
<p>Als ich dann endlich im Studienb&uuml;ro zu meinem Schalter gekommen bin, konnte ich mein Problem vorstellen. Ich versuche das m&ouml;glichst wortw&ouml;rtlich wiederzugeben:</p>
<ol>
<li>Das Modul "Algorithmen I" war nicht als bestanden markiert, obwohl ich die Klausur "Algorithmen I" bestanden habe, diese auch als bestanden im System stand und es keine weiteren Voraussetzungen gibt.
Das habe ich der Angestellten so gesagt.
Angestellte: &bdquo;Da kann ich nichts machen, ich brauche erst ein Formular. Ohne Formular geht da nichts, da m&uuml;ssen sie zu Frau Gheta, ich muss 3 Schalter betreuen und habe daf&uuml;r keine Zeit.&ldquo;</li>
</ol>
<p>Was soll denn das? Ein kurzer Blick ins Modulhandbuch - ich konnte auch sagen an welcher Stelle - ein Blick auf meine Leistungen (die sie bereits aufgerufen hatte) und alles w&auml;re klar geweisen. Also habe ich das Problem
nochmals beschrieben
Ich: &bdquo;Ich habe alle Teile des Moduls bestanden, warum ist dann das Modul nicht als bestanden markiert?&ldquo;
Sie schaut in ihr System und sagt mir, dass ich noch nicht alles aus der Theoretischen Informatik bestanden habe.
Warum hat sie pl&ouml;tzlich mit theoretischer Informatik angefangen? Ich habe nichts von Theoretischer Informatik gesagt und mir ist klar, dass ich f&uuml;r das Fach noch nicht alles bestanden habe. Aber das hat doch nichts mit dem Modul zu tun.</p>
<ol>
<li>Obwohl ich die &Uuml;bungsscheine &bdquo;Lineare Algebra I&ldquo; und &bdquo;Lineare Algebra II&ldquo; f&uuml;r Mathematiker gemacht und bestanden habe, ist nur ein &Uuml;bungsschein &bdquo;Lineare Algebra I f&uuml;r die fachrichtung Informatik&ldquo; in QISPOS. Also sollte der &Uuml;bungsschein &bdquo;Lineare Algebra I f&uuml;r die fachrichtung Informatik&ldquo; in &bdquo;Lineare Algebra I&ldquo; umgewandelt werden und der &Uuml;bungsschein &bdquo;Lineare Algebra II&ldquo; hinzugef&uuml;gt werden. Ich habe beide Scheine in Papierform, vom Prof. unterschrieben, dabei gehabt und ihr gegeben.
Angestellte legt die beiden &Uuml;bungsschein-Best&auml;tigungen auf einen Ablagestapel
Angestellte: &bdquo;Daf&uuml;r ben&ouml;tigen sie eine Best&auml;tigung.&ldquo;
Ich: &bdquo;Aber ich habe Ihnen doch gerade die Best&auml;tigung gegeben?!?&ldquo;
Angestellte: &bdquo;F&uuml;r eine Ummeldung muss ein anderes Formular ausgef&uuml;llt werden. Ich kann so nur die &Uuml;bungsscheine hinzuf&uuml;gen.&ldquo;
Na gut, dann habe ich nun wohl einen &Uuml;bungsschein zu viel ...
Nach ein bisschen Diskutieren meint sie, ich h&auml;tte wegen HM bereits einen Antrag gemacht. Ich habe niemals HM besucht und hatte bisher auch keine Probleme wegen HM vs. Analysis. Hoffentlich kommt das jetzt nicht dazu ...</li>
</ol>
<p>Insgesamt muss ich sagen, wurde ich unfreundlich behandet - ich hatte das Gef&uuml;hl, direkt wieder rausgeworfen zu werden - und die Frau hat mir nicht zugeh&ouml;rt. Kurz darauf bin ich zum &bdquo;Servicezentrum f&uuml;r Studium und Lehre&ldquo; gegangen. Dort hat mir Frau Metzig geholfen. Sie hat mein Problem verstanden. Nach wenigen Minuten, ohne langes Anstehen oder irgendwelche Formulare hat sie mir versichert, dass Sie sich um das Problem in den n&auml;chsten zwei Tagen k&uuml;mmert. Schon nach 2 Stunden kam eine E-Mail an, in der sie mir mitteilte, dass es ein Systemfehler war. Mein Problem ist nun behoben.</p>
<h2 id="qispos_1">QISPOS</h2>
<p>QISPOS ist ein System von der <a href="http://de.wikipedia.org/wiki/Hochschul-Informations-System">HIS Hochschul-Informations-System GmbH</a>, das am KIT f&uuml;r die Pr&uuml;fungsverwaltung eingesetzt wird. Das bedeutet, hier meldet man sich an und ab, kann Noten und bestandene Module nachschauen. Auch Voraussetzungen f&uuml;r andere Module wie z.B. PSE werden hiermit &uuml;berpr&uuml;ft.</p>
<p>Dieses System muss ziemlich schwere Voraussetzungen erf&uuml;llen: Es muss funktionieren. Immer. Leider ist das nicht der Fall:</p>
<ul>
<li>Pr&uuml;fungsanmeldungen klappen nicht. Es werden fehlende Voraussetzungen angezeigt, obwohl es keine Voraussetzungen gibt (ist mir mit Algorithmen passiert)</li>
<li>Die Anmeldung f&uuml;r manche Module ist nicht m&ouml;glich, obwohl sie laut Modulhandbuch m&ouml;glich ist (z.B. Physiker und Mathe)</li>
<li>Sonstige Systemfehler kommen vor: Das Modul Algorithmen wurde bei mir nicht als bestanden markiert, obwohl es offensichtlich bestanden war.</li>
</ul>
<p>Das sind jetzt nur ein paar Fehler, die mir pers&ouml;nlich passiert sind. Es gibt bestimmt noch mehr. Und von unsch&ouml;nen Dingen wie langen Ladezeiten, einer schlechten Men&uuml;f&uuml;hrung oder einer fehlenden Suchfunktion will ich mal gar nicht reden.</p>
<p>Da frage ich mich schon, was das KIT daf&uuml;r bezahlt. Einfach gesagt, sehe ich zwei M&ouml;glichkeiten:</p>
<ol>
<li>Es wird sehr wenig bezahlt: Dann ist es kein Wunder, dass diese Probleme auftreten. Dann sollte man sich &uuml;berlegen, ob es nicht sinnvoll w&auml;re, mehr zu investieren</li>
<li>Man zahlt angemessen / viel f&uuml;r die geforderten Eigenschaften: In diesem Fall sollte man sich nach einem anderem Anbieter umsehen oder selbst eine Entwicklung starten.</li>
</ol>
<p>Ehrlich gesagt wundert es mich, dass es hierf&uuml;r keine Uni-Eigene L&ouml;sung gibt. Gibt es OpenSource in diesem Bereich?</p>
<h2 id="haufige-probleme-faq">H&auml;ufige Probleme - FAQ</h2>
<p>Als ich gewartet habe, sind mir zwei h&auml;ufige Probleme aufgefallen:</p>
<ul>
<li>Defekte KIT-Card</li>
<li>Keine Matrikelnummer</li>
</ul>
<p>Eine defekte KIT-Card sollte einfach &uuml;ber ein Online-Formular nachbestellbar sein. Ich sehe keinen Grund, warum man dazu in das Studienb&uuml;ro gehen sollte.</p>
<p>Wenn jetzt, nach beginn der Vorlesungszeit, noch keine Matrikelnummer vorhanden ist, l&auml;uft irgendwas schief. Da es bei vielen der Fall ist, kann es nicht an den Studenten liegen. Entweder wurden bestimmte voraussetzungen nicht deutlich genug gemacht (&agrave; la: Es muss Formular XY zur&uuml;ckgeschickt werden, bevor eine Matrikelnummer ausgestellt wird), oder es der Prozess eine Matrikelnummer zu erstellen dauert zu lange. Falls das zu lange dauert, kann man entweder den Prozessablauf beschleunigen, oder mehr Personal einstellen.</p>
<p>Eine einfache FAQ-Liste auf der Seite des Studienb&uuml;ros k&ouml;nnte schon helfen.</p>
<p>So, jetzt habe ich einige Stunden mit B&uuml;rokratie, Organisation und diesem Bericht dar&uuml;ber verbacht und etwas Frust abgebaut. Zeit, die ich in mein Studium h&auml;tte stecken k&ouml;nnen. Vielleicht liest es ja jemand, der etwas &auml;ndern kann.</p>
<p>Habt ihr &auml;hnliche Geschichten mit dem Studienb&uuml;ro erlebt? Habt ihr Verbesserungsvorschl&auml;ge? Dann hinterlasst doch einfach einen Kommentar.</p>
            
            <div id="disqus_thread" class="no-print"></div>
<script>
    /*
    var disqus_config = function () {
        this.page.url = PAGE_URL;  // Replace PAGE_URL with your page's canonical URL variable
        this.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
    };
    */
    (function() {  // REQUIRED CONFIGURATION VARIABLE: EDIT THE SHORTNAME BELOW
        var d = document, s = d.createElement('script');

        s.src = '//martinthoma.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>

            <hr/>
        </div>
        <section>
        <div class="col-sm-2 col-md-2" style="float:right;font-size:0.9em;">
            <h4>Published</h4>
            <time pubdate="pubdate" datetime="2012-10-17T18:06:31+02:00">Okt 17, 2012</time>
            <br/>
            by <a rel="author" class="vcard author post-author" itemprop="author" href="../author/martin-thoma/"><span class="fn" itemscope="" itemtype="https://schema.org/Person"><span itemprop="name">Martin Thoma</span></span></a>
            <h4>Category</h4>
            <a class="category-link" href="../categories.html#german-posts-ref">German posts</a>
            <h4>Tags</h4>
            <ul class="list-of-tags tags-in-article">
                <li><a href="../tags.html#kit-ref">KIT
                    <span>19</span>
</a></li>
            </ul>
<h4>Contact</h4>
    <a href="https://twitter.com/_martinthoma" title="My Twitter Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-twitter sidebar-social-links"></i></a>
    <a href="mailto:info@martin-thoma.de" title="My Email Address" class="sidebar-social-links" target="_blank">
    <i class="fa fa-envelope sidebar-social-links"></i></a>
    <a href="https://github.com/MartinThoma" title="My Github Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-github sidebar-social-links"></i></a>
    <a href="http://stackoverflow.com/users/562769/martin-thoma" title="My Stackoverflow Profile" class="sidebar-social-links" target="_blank">
    <i class="fa fa-stackoverflow sidebar-social-links"></i></a>
        </div>
        </section>
</div>
</article>
                </div>
                <div class="col-sm-1 col-md-1"></div>
            </div>
        </div>
        <div id="push"></div>
    </div>
<footer class="no-print">
<div id="footer">
    <ul class="footer-content">
        <li class="elegant-subtitle"><span class="site-name">Martin Thoma</span> - A blog about Code, the Web and Cyberculture</li>
        <li><a href="https://martin-thoma.com/email-subscription">E-mail subscription</a></li>
        <li><a href="https://martin-thoma.com/feeds/index.xml">RSS-Feed</a></li>
        <li><a href="http://www.martin-thoma.de/privacy.htm">Privacy/Datenschutzerkl&auml;rung</a></li>
        <li><a href="http://www.martin-thoma.de/impressum.htm">Impressum</a></li>
        <li class="elegant-power">Powered by
            <a href="https://blog.getpelican.com/" title="Pelican Home Page" tabindex="-1">Pelican</a>.
            Theme: <a href="https://elegant.oncrashreboot.com" title="Theme Elegant Home Page" tabindex="-1">Elegant</a>
            by <a href="https://www.oncrashreboot.com/" title="Talha Mansoor Home Page" tabindex="-1">Talha Mansoor</a></li>
    </ul>
</div>
</footer>        <script src="//code.jquery.com/jquery.min.js"></script>
        <!-- Latest compiled and minified JavaScript -->
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa" crossorigin="anonymous"></script>
        <script>
            function validateForm(query)
            {
                return (query.length > 0);
            }
        </script>
        <script>
(function(){
    'use strict';

    /*
    Create intra-page links
    Requires that your headings already have an `id` attribute set
    For every heading in your page, this adds a little anchor link `#` that you can click to get a permalink to the heading.
    Ignores `h1`, because you should only have one per page.
    The text content of the tag is used to generate the link, so it will fail "gracefully-ish" if you have duplicate heading text.

    Credit: https://gist.github.com/SimplGy/a229d25cdb19d7f21231
     */

    var headingNodes = [], results, link,
        tags = ['h2', 'h3', 'h4', 'h5', 'h6'];

    tags.forEach(function(tag){
        var contentTag = document.getElementById('contentAfterTitle');
      results = contentTag.getElementsByTagName(tag);
      Array.prototype.push.apply(headingNodes, results);
    });

    headingNodes.forEach(function(node){
      link = document.createElement('a');
      link.className = 'deepLink';
      link.textContent = ' ¶';
      link.href = '#' + node.getAttribute('id');
      node.appendChild(link);
    });

  })();
</script>
    </body>
    <!-- Theme: Elegant built for Pelican
    License : https://elegant.oncrashreboot.com -->
</html>